main_menu = ['Главное меню',
            'Открыть файл',
            'Сохранить файл',
            'Показать все контакты',
            'Добавить контакт',
            'Найти контакт',
            'Изменить контакт',
            'Удалить контакт',
            'Выход']

select_menu = 'Выберете пункт меню: '


input_error = f'Ошибка ввода. Введите число от 1 до {len(main_menu)-1}: '

new_contact = {'name': 'Ввудите имя контакта: ',
                'phone': 'Введите телефон: ',
                'comment': 'Введите комментарий'}

empty_book = 'Телефонная книга пуста или не открыта'